Revit 2024 API
ScheduleField.TotalByAssemblyType Property
 In an assembly schedule view, indicates if totals are calculated for all assembly instances of the same type or only for a single instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool TotalByAssemblyType { get; set; }
Visual Basic
Public Property TotalByAssemblyType As Boolean
	Get
	Set
Visual C++
public:
property bool TotalByAssemblyType {
	bool get ();
	void set (bool value);
}
Field Value
 True if totals are calculated for all assembly instances. False if totals are calculated for one instance.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This ScheduleField cannot be totaled by assembly type. -or- When setting this property: Totals are not enabled for this ScheduleField.
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace